---
title: LevelFailures
classe: Autodesk.Revit.DB.BuiltInFailures+LevelFailures
namespace: Autodesk.Revit.DB
eredita: System.Object
revit: "2025"
revitapi: "25.4.30.0"
stato: auto
verbo: leggere
membri_n: 5
---

# LevelFailures

!!! note "Scheda automatica"
    La corrispondenza C#→Python è generata dalle 7 Regole. Descrizione, tranello ed esempio sono **da rivedere** — contribuisci.

## La classe

_(una frase: cos'è e a cosa serve)_

## La corrispondenza

| nella doc (C#) | in python | tipo |
|---|---|---|
| `FailureDefinitionId NoLevelsLeft { get; }` | `LevelFailures.NoLevelsLeft` | FailureDefinitionId |
| `FailureDefinitionId NoLevelsLeftReloading { get; }` | `LevelFailures.NoLevelsLeftReloading` | FailureDefinitionId |
| `FailureDefinitionId StoryAboveDeleted { get; }` | `LevelFailures.StoryAboveDeleted` | FailureDefinitionId |
| `FailureDefinitionId StoryAboveMoved { get; }` | `LevelFailures.StoryAboveMoved` | FailureDefinitionId |
| `FailureDefinitionId StoryAboveNonStoryLevel { get; }` | `LevelFailures.StoryAboveNonStoryLevel` | FailureDefinitionId |

## Il tranello

_(ciò che la pagina non dice e ti farebbe sbagliare)_

## Lo script

```python
# esempio da completare
```